Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་ཕྲག་ལྔའོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་གསུམ་མོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་གཉིས་སོ། །
en: In the first congregation there will be five billion hearers, in the second there will be three billion, and in the third there will be two billion.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for five thousand years.

source: དེ་བཞིན་གཤེགས་པ་གཙུག་ན་ནོར་བུ་སྐྱེ་བའི་ཡུལ་ནི་འོད་གསལ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Maṇicūḍa will be called Luminosity.

source: ཡབ་ནི་རྟོགས་དགའ་ཞེས་བྱའོ། །
en: Joyous Understanding will be his father.

source: ཡུམ་ནི་ཙམ་པ་བདག་ཅེས་བྱའོ། །
en: Campaka Lady will be his mother.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Jewel Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཅེས་བྱའོ། །
en: Austerities of Yogic Discipline will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་བརྒྱ་ཕྲག་དགུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་བཅུའོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་གཉིས་སོ། །
en: In the first congregation there will be nine billion hearers, in the second there will be ten billion, and in the third there will be twelve billion.

source: དེ་བཞིན་གཤེགས་པ་དྲག་ཤུལ་ཅན་སྐྱེ་བའི་ཡུལ་ནི་བདེ་སྐྱིད་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Ugra will be called Happy.

source: ཡབ་ནི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa will be his father.

source: ཡུམ་ནི་སཱ་ལ་བདག་ཅེས་བྱའོ། །
en: Śāla Lady will be his mother.

source: སྲས་ནི་འོད་ལྡན་ཞེས་བྱའོ། །
en: Luminous will be his son.

source: རིམ་གྲོ་པ་ནི་ནོར་བུ་དགའ་ཞེས་བྱའོ། །
en: Jewel of Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐལ་ལྡན་འོད་ཅེས་བྱའོ། །
en: Fortunate Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགྲ་འདུལ་ཞེས་བྱའོ། །
en: Enemy Tamer will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་ལྔའོ། །
en: In the first congregation there will be one hundred thirty million worthy hearers, in the second there will be one hundred eighty million, and in the third there will be one hundred fifty million.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟབས་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Siṃhagati will be called Studded.

source: འོད་ནི་དཔག་ཚད་སུམ་ཅུ་རྩ་གསུམ་མོ། །
en: His light will extend thirty-three leagues.

source: ཡབ་ནི་རི་དགའ་ཞེས་བྱའོ། །
en: Mountain of Joy will be his father.

source: ཡུམ་ནི་སྨན་ཞེས་བྱའོ། །
en: Medicine will be his mother.

source: སྲས་ནི་གྲུ་འཛིན་ཅེས་བྱའོ། །
en: Harbor will be his son.

source: རིམ་གྲོ་པ་ནི་དལ་བར་འགྲོ་ཞེས་བྱའོ། །
en: Leisurely Movement will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་གཉིད་སངས་ཞེས་བྱའོ། །
en: Awakening from Sleep will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡུལ་འཁོར་གཞོལ་ཞེས་བྱའོ། །
en: Expansive Land will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ས་ཡ་ཕྲག་གཅིག་དང་འབུམ་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་ས་ཡ་ཕྲག་གཅིག་དང་འབུམ་ཕྲག་དྲུག་གོ། །གསུམ་པ་ལ་ནི་ས་ཡ་ཕྲག་གཅིག་དང་འབུམ་ཕྲག་བཞིའོ། །
en: In the first congregation there will be one million seven hundred thousand hearers, in the second there will be one million six hundred thousand, and in the third there will be one million four hundred thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་བདུན་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy million years.

source: དེ་བཞིན་གཤེགས་པ་ལྗོན་པ་སྐྱེ་བའི་ཡུལ་ནི་ཙམ་པ་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Druma will be called Supreme Campaka.

source: ཡབ་ནི་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Śālas will be his father.

source: ཡུམ་ནི་བློ་གྲོས་ཏོག་ཅེས་བྱའོ། །
en: Crest of Intelligence will be his mother.

source: སྲས་ནི་འགྲོ་བར་དགའ་ཞེས་བྱའོ། །
en: Joyous Movement will be his son.

source: རིམ་གྲོ་པ་ནི་འོད་ཟེར་བྱིན་ཞེས་བྱའོ། །
en: Radiant Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐར་བ་དགའ་ཞེས་བྱའོ། །
en: Liberation Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐུབ་དཀའ་ཞེས་བྱའོ། །
en: Hard to Achieve will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བཞི་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་གསུམ་མོ། །
en: In the first congregation there will be four hundred eighty million hearers, in the second there will be three hundred fifty million, and in the third there will be three hundred thirty million.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་རྒྱལ་བ་ཅན་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་སྨན་ལྡན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Vijitāvin will be called Land of Medicine.

source: ཡབ་ནི་དགའ་བས་ལྷ་ཞེས་བྱའོ། །
en: Joyous God will be his father.

source: ཡུམ་ནི་ནོར་སྦྱིན་མ་ཞེས་བྱའོ། །
en: Wealth Gift will be his mother.

source: སྲས་ནི་དཔའ་བོས་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Heroes will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་སྦྱིན་ཞེས་བྱའོ། །
en: Dharma Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་རྒྱལ་བ་ཞེས་བྱའོ། །
en: Universal Victor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་གྲགས་ཞེས་བྱའོ། །
en: Famed Offering will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་བཞིའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །
en: In the first congregation there will be seven hundred sixty million hearers, in the second there will be seven hundred forty million, and in the third there will be seven hundred twenty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲིའི་བར་དུ་གནས་སོ། །
en: The extent of his lifespan will be eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་བརྩེགས་སྐྱེ་བའི་ཡུལ་ནི་བཟང་སྦྱིན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Prajñākūṭa will be called Gift of Excellence.

source: འོད་ནི་དཔག་ཚད་བཅུ་གཅིག་གོ། །
en: His light will extend eleven leagues.

source: ཡབ་ནི་ཐམས་ཅད་སྦྱིན་ཞེས་བྱའོ། །
en: Giver of Everything will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་སྦྲང་རྩི་ཞེས་བྱའོ། །
en: Splendid Honey will be his mother.

source: སྲས་ནི་ཚངས་ལྷ་ཞེས་བྱའོ། །
en: Brahmā God will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་ཀྱི་གྲགས་པ་ཞེས་བྱའོ། །
en: Dharma Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དབང་པོའི་ཡིད་ཅེས་བྱའོ། །
en: Mind of the Capable will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཙོ་བོ་ཞེས་བྱའོ། །
en: Leader will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བཞི་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞི་དང་བྱེ་བ་ཕྲག་གསུམ་མོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞི་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །
en: In the first congregation there will be four hundred fifty million hearers, in the second there will be four hundred thirty million, and in the third there will be four hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་གནས་སྐྱེ་བའི་ཡུལ་ནི་ཤིང་རྟ་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Susthita will be called Chariot of Splendor.

source: ཡབ་ནི་ཚུགས་པ་མེད་པའི་བཞིན་ཞེས་བྱའོ། །
en: Indomitable Countenance will be his father.

source: སྲས་ནི་སྦེད་པ་པོ་ཞེས་བྱའོ། །
en: Concealer will be his son.

source: རིམ་གྲོ་པ་ནི་དྲང་སྲོང་བློ་ཞེས་བྱའོ། །
en: Sage Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བླ་མས་བྱིན་ཞེས་བྱའོ། །
en: Guru Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ནོར་གྱི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of Wealth will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བཞི་ཁྲི་དྲུག་སྟོང་ངོ་། །གཉིས་པ་ལ་ནི་བཞི་ཁྲི་ལྔ་སྟོང་ངོ་། །གསུམ་པ་ལ་ནི་བཞི་ཁྲི་སུམ་སྟོང་ངོ་། །
en: In the first congregation there will be forty-six thousand hearers, in the second there will be forty-five thousand, and in the third there will be forty-three thousand.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་འོང་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Mati will be called Attractive Joy.

source: ཡབ་ནི་ཚུལ་ཁྲིམས་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Discipline will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་བློ་གྲོས་ཞེས་བྱའོ། །
en: Qualities of Intelligence will be his mother.

source: སྲས་ནི་ཉི་མས་བྱིན་ཞེས་བྱའོ། །
en: Sun Gift will be his son.

source: རིམ་གྲོ་པ་ནི་དབང་པོས་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Capable will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤྱོད་པ་ཞེས་བྱའོ། །
en: Conduct will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་སེམས་ཞེས་བྱའོ། །
en: Precious Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་དགུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: In the first congregation there will be ninety million hearers, in the second there will be seventy million, and in the third there will be sixty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡན་ལག་སྐྱེས་སྐྱེ་བའི་ཡུལ་ནི་གནས་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Aṅgaja will be called Abode of Joy.

source: ཡབ་ནི་དབང་པོའི་མཚོན་ཆ་ཞེས་བྱའོ། །
en: Weapon of the Capable will be his father.

source: ཡུམ་ནི་ལྷ་མོའི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Leader of Goddesses will be his mother.

source: སྲས་ནི་ཆུ་ལྷའི་ལྷ་ཞེས་བྱའོ། །
en: God of the Water Gods will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེས་རབ་གཙུག་ཅེས་བྱའོ། །
en: Insight Crown will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་བླ་མ་ཞེས་བྱའོ། །
en: Highest Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་དཔལ་ཞེས་བྱའོ། །
en: Dharma Glory will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །
en: In the first congregation there will be nine hundred million hearers, in the second there will be eight hundred million, and in the third there will be seven hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twelve thousand years.

source: དེ་བཞིན་གཤེགས་པ་བློ་མཐའ་ཡས་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་གི་གདུགས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Amitabuddhi will be called Flower Parasol.

source: ཡབ་ནི་མིག་དམར་ཞེས་བྱའོ། །
en: Red Eye will be his father.

source: ཡུམ་ནི་ཀླུས་བྱིན་ཞེས་བྱའོ། །
en: Nāga Gift will be his mother.

source: སྲས་ནི་མཛེས་པ་ཞེས་བྱའོ། །
en: Beauty will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷ་བཟངས་ཞེས་བྱའོ། །
en: Divine Excellence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲ་སྙན་ཞེས་བྱའོ། །
en: Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དལ་འགྲོ་ཞེས་བྱའོ། །
en: Leisurely Movement will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞིའོ། །
en: In the first congregation there will be seven hundred million hearers, in the second there will be five hundred million, and in the third there will be four hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་དྲུག་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for sixty million years.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་བཟང་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Surūpa will be called Splendid.

source: ཡབ་ནི་དགའ་བའི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Lord of Joy will be his father.

source: སྲས་ནི་འགྲོ་དོན་གྲུབ་ཅེས་བྱའོ། །
en: Accomplishment of the Welfare of Beings will be his son.

source: རིམ་གྲོ་པ་ནི་བླ་མས་བྱིན་ཞེས་བྱའོ། །
en: Guru Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་རྒྱ་ཆེན་ཞེས་བྱའོ། །
en: Vast Merit will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བག་མི་ཚ་བ་ཞེས་བྱའོ། །
en: Undaunted will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: In the first congregation there will be seven hundred million hearers, in the second there will be nine hundred million, and in the third there will be one billion.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for sixteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་མཁྱེན་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་བདེ་བ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Jñānin will be called Array of Bliss.

source: ཡུམ་ནི་རྡུལ་བྲལ་ཞེས་བྱའོ། །
en: Immaterial will be his mother.

source: སྲས་ནི་དཔའ་བོ་ཞེས་བྱའོ། །
en: Hero will be his son.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྐྱེ་བའི་ཡུལ་ནི་བཻ་དཱུརྱའི་འོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Raśmi will be called Beryl Light.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་ཅུ་རྩ་གསུམ་མོ། །
en: His light will extend eighty-three leagues.

source: ཡབ་ནི་ཕན་པར་དགའ་ཞེས་བྱའོ། །
en: Enjoying to Help will be his father.

source: ཡུམ་ནི་ཡིད་དགའ་ཞེས་བྱའོ། །
en: Happy Mind will be his mother.

source: སྲས་ནི་ཡིད་སྨོན་ཞེས་བྱའོ། །
en: Aspiring Mind will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོ་ག་དགའ་ཞེས་བྱའོ། །
en: Delighting in Ritual will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཕགས་དགྱེས་དགའ་ཞེས་བྱའོ། །
en: Delighting in Pleasing the Noble will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དུལ་བའི་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Friend of the Vinaya will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: In the first congregation there will be two hundred eighty million hearers, in the second there will be eight hundred seventy million, and in the third there will be eight hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཤུགས་བརྟན་སྐྱེ་བའི་ཡུལ་ནི་ཉི་མ་འདོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Dṛḍhavrata will be called Sun Wish.

source: ཡབ་ནི་ལྷ་དགའ་ཞེས་བྱའོ། །
en: Divine Joy will be his father.

source: ཡུམ་ནི་ང་རོ་ཡིད་བཟང་ཞེས་བྱའོ། །
en: Melody of Fine Mind will be his mother.

source: སྲས་ནི་དབང་ཕྱུག་བྱིན་ཞེས་བྱའོ། །
en: Master Gift will be his son.

source: རིམ་གྲོ་པ་ནི་ཡིད་འོང་ང་རོ་ཞེས་བྱའོ། །
en: Pleasing Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཉི་མས་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Sun will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྦྲང་རྩི་ཞེས་བྱའོ། །
en: Honey will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་ལྔའོ། །
en: In the first congregation there will be one billion hearers, in the second there will be nine hundred seventy million, and in the third there will be nine hundred fifty million.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་བཞིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for four hundred million years.

source: དེ་བཞིན་གཤེགས་པ་བཀྲ་ཤིས་སྐྱེ་བའི་ཡུལ་ནི་དགའ་འདུལ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Maṅgala will be called Joyous Training.

source: ཡབ་ནི་སེམས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Mind will be his father.

source: སྲས་ནི་མཐའ་ཡས་ལག་ཅེས་བྱའོ། །
en: Infinite Hand will be his son.

source: རིམ་གྲོ་པ་ནི་བཤེས་གཉེན་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Royal Friend will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་རྒྱལ་བའི་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Victorious Friend will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པའི་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་སྒྲོགས་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Satyaketu will be called Joyous Proclamation.

source: ཡབ་ནི་བསོད་ནམས་སྟེགས་ཞེས་བྱའོ། །
en: Support for Merit will be his father.

source: ཡུམ་ནི་བཟང་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with Excellence will be his mother.

source: སྲས་ནི་སྙན་པར་དགའ་ཞེས་བྱའོ། །
en: Delightful to Hear will be his son.

source: རིམ་གྲོ་པ་ནི་བཤེས་གཉེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Friend will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བ་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Moon will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སཱ་ལའི་མིག་ཅེས་བྱའོ། །
en: Śāla Eye will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །
en: In the first congregation there will be eight hundred million hearers, in the second there will be seven hundred million, and in the third there will be six hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཀྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty million years.

source: དེ་བཞིན་གཤེགས་པ་པད་མ་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་རྒྱས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Padma will be called Splendor of Blooming Flowers.

source: ཡབ་ནི་ནོར་སྦྱིན་ཞེས་བྱའོ། །
en: Wealth Gift will be his father.

source: ཡུམ་ནི་དགའ་བ་ཅན་ཞེས་བྱའོ། །
en: Joyous will be his mother.

source: རིམ་གྲོ་པ་ནི་ཐུབ་དགའ་ཞེས་བྱའོ། །
en: Hard to Achieve will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་འོད་ཅེས་བྱའོ། །
en: Dharma Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྨན་ཆེན་ཞེས་བྱའོ། །
en: Great Medicine will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཁྲིའོ། །གཉིས་པ་ལ་ནི་དགུ་ཁྲི་དགུ་སྟོང་ངོ་། །གསུམ་པ་ལ་ནི་དགུ་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: In the first congregation there will be ten thousand hearers, in the second there will be ninety-nine thousand, and in the third there will be ninety-eight thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་ཀྱི་བུ་སྐྱེ་བའི་ཡུལ་ནི་མཚམས་བརྟན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Nārāyaṇa will be called Stable Borders.

source: ཡབ་ནི་དགའ་བའི་མིག་ཅེས་བྱའོ། །
en: Eye of Joy will be his father.

source: ཡུམ་ནི་ཡིད་བཟང་སྦྱིན་ཞེས་བྱའོ། །
en: Excellent Gift will be his mother.

source: སྲས་ནི་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellence will be his son.

source: རིམ་གྲོ་པ་ནི་གཙུག་ན་ནོར་བུ་ཞེས་བྱའོ། །
en: Crown Jewel will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བྱང་ཆུབ་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Friend of Awakening will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་བཞིན་ཞེས་བྱའོ། །
en: Moon Countenance will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: In the first congregation there will be six hundred million hearers, in the second there will be five hundred million, and in the third there will be nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་ལག་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Subāhu will be called Happy Mind.

source: ཡབ་ནི་རིན་ཆེན་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Jewels will be his father.

source: ཡུམ་ནི་བློ་གྲོས་བླ་མ་ཞེས་བྱའོ། །
en: Highest Intelligence will be his mother.

source: སྲས་ནི་གཟུངས་ཀྱི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Master of Retention will be his son.

source: རིམ་གྲོ་པ་ནི་དྲག་ཤུལ་ཅན་ཞེས་བྱའོ། །
en: Wrathful will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་ཟེར་ཟླ་བ་ཞེས་བྱའོ། །
en: Radiant Moon will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་ཏོག་ཅེས་བྱའོ། །
en: Lion Crest will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བཞིའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །
en: In the first congregation there will be nine hundred sixty million hearers, in the second there will be nine hundred forty million, and in the third there will be nine hundred twenty million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty-four thousand years.

source: སངས་རྒྱས་ཡེ་ཤེས་འབྱུང་གནས་སྐྱེ་བའི་ཡུལ། །གྲོང་ཁྱེར་བསོད་ནམས་འབྱོར་དང་ལྡན་ཞེས་བྱ། །
en: “The birthplace of the buddha Jñānākara Will be the city called Wealth of Merit.

source: དེ་ཡི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །དགའ་བ་རྒྱ་མཚོ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: His family will be kṣatriya, And his light will cover ten leagues. “His father will be Freedom from Suffering and his mother Ocean of Joy.

source: སྲས་ནི་ཡིད་གཞུངས་ལེགས་བྱིན་རིམ་གྲོ་པ། །ཡེ་ཤེས་ཡང་དག་འཕགས་པ་མཁས་པ་སྟེ། །
en: Sincere will be his son and Gift of Excellence his attendant. The expert will be Superior True Wisdom

source: བསོད་ནམས་དགའ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Merit Joy the one endowed with miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་ཕྲག་སྟོང་ཡོད། །གཉིས་པར་བྱེ་བརྒྱད་གསུམ་པར་བྱེ་བ་བདུན། །
en: “In his first congregation will be one hundred million. In the second there will be eighty million, and in the third there will be seventy million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་སྟེ། །
en: His lifespan will be eighty thousand years,

source: ལྔ་འགྱུར་དག་ཏུ་དམ་པའི་ཆོས་ཀྱང་གནས། །
en: And his sacred Dharma will endure five times as long as that.

source: རྒྱལ་བ་དེ་ཡི་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །
en: “The relics of that victor will be abundant.

source: སྐད་ཅིག་དེ་ལ་བདེ་བར་གཤེགས་པ་དེའི། །མཚན་ནི་གང་དག་ཉན་པར་བྱེད་པ་རྣམས། །བྱང་ཆུབ་ལ་ནི་མྱུར་དུ་རེག་པར་འགྱུར། །
en: Whoever recites the name of this well-gone one Even for just an instant Will quickly reach awakening.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་འོད་འཕྲོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་སྨན་ཅེས་བྱ། །
en: “The thus-gone Guṇārci will be born In the city called Medicine.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡུལ་འཁོར་བཟང་པོ་ཡབ། །
en: His family will be kṣatriya and his light will extend ten leagues. His father will be Land of Excellence,

source: མྱ་ངན་མེད་ལྡན་ཡུམ་ཡིན་གྲགས་པ་སྲས། །
en: “His mother, Freedom from Suffering, and his son, Fame.

source: མཛེས་དང་ལྡན་ཞེས་བྱ་བ་རིམ་གྲོ་པ། །
en: His attendant will be called Beautiful,

source: ཏོག་མཁས་ཐོས་རིག་རབ་གསལ་རྫུ་འཕྲུལ་ཅན། །
en: The scholar will be Crest, and Clear Knowledge of the Heard will possess miracles.

source: འདུས་པ་དང་པོར་བྱེ་སྟོང་བརྒྱད་ཅུ་སྟེ། །གཉིས་པར་བྱེ་སྟོང་བདུན་ཅུ་རྩ་བརྒྱད་ཡོད། །འདུས་པ་གསུམ་པར་བྱེ་སྟོང་བདུན་ཅུ་ལྔ། །
en: In his first congregation will be eight hundred billion, “In the second there will be seven hundred eighty billion, And in the third there will be seven hundred fifty billion.

source: མི་རྣམས་དག་གི་ཚེ་ལོ་བྱེ་བ་ཕྲག །སྟོང་དུ་ཚང་བ་ཉི་ཤུ་རྩ་གཉིས་ཡོད། །
en: The lifespan of humans will reach Two hundred twenty billion years,

source: དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་གསུམ། །གནས་འགྱུར་འཇིག་རྟེན་སྒྲོན་མ་མཛད་པ་པོ། །གྲགས་པ་མཐའ་ཡས་དེ་ཡི་སྐུ་གདུང་དག །རྣམ་པར་རྒྱས་པ་དག་ཏུ་འགྱུར་བ་ཡིན། །
en: “And the sacred Dharma will remain for seventy-three thousand years. From this lamp for the world Endowed with infinite fame Will emerge abundant relics.

source: བདེ་བར་གཤེགས་པ་ཚངས་པས་བྱིན་པ་ཡི། །སྐྱེ་ཡུལ་གྲོང་ཁྱེར་དགའ་བ་སྒྲོགས་ཞེས་བྱ། །
en: “The well-gone Brahmadatta Will be born in a land called Joyous Proclamation.

source: རྒྱལ་བ་དེ་ཡི་རིགས་ནི་བྲམ་ཟེ་ཡིན། །
en: The family of that victor will be brahmin.

source: འོད་ནི་དཔག་ཚད་བདུན་ཅུ་རྩ་དྲུག་ཡོད། །
en: His radiance will reach seventy-six leagues,

source: ཚངས་པ་ཡབ་ཡིན་ཡུམ་ནི་ཚངས་བླ་མ། །
en: His father will be Brahmā, and his mother Highest Brahmā.
